<template>
  <div class="p-14 rounded relative bg-center bg-cover bg-no-repeat bg-[url('@/assets/refs/human.png')] mb-20">
    <img
      src="@/assets/img/quotes.svg"
      class=" absolute top-[130px] left-14"
    >
    <h3 class="text-3xl font-bold text-white mb-14">
      О нас
    </h3>
    <p class="text-white w-1/2 ml-4">
      Мы работаем на российском рынке с 1994 года и предоставляем нашим клиентам полный спектр транспортно-экспедиционных услуг, а так же качественное складское обслуживание.
      За годы успешной деятельности мы приобрели серьезный опыт и доверие наших партнеров, среди которых ведущие российские и зарубежные компании (L’Oreal, Bacardi, Volkswagen, АСТ, Wella, Mercedes, Русский Стандарт и многие другие).
      <br><br>
      Наша цель — предоставить вам самую актуальную, полезную и интересную информацию о логистике, которая поможет вам
      оптимизировать свой бизнес, повысить свою конкурентоспособность и достичь успеха.
      <br><br>
      Наша аудитория — это профессионалы и энтузиасты логистики, которые хотят быть в курсе всех новостей и
      возможностей в этой области. Наш портал посещают более 100 тысяч человек в месяц. Мы гордимся тем, что наш
      портал является одним из самых популярных и авторитетных источников информации о логистике в России.
    </p>
  </div>
</template>

<script setup lang="ts">

</script>

<style scoped></style>