<template>
  <div class="mb-16">
    <h2 class="text-4xl font-bold mb-8">
      Рубрики
    </h2>
    <div class="grid grid-cols-3 gap-6">
      <div
        v-for="(item, i) in rubricks"
        :key="i"
        class="col-span-1"
      >
        <div class="rounded-xl shadow-lg p-8 text-center transition-all hover:bg-gray-400 hover:text-white h-full">
          <p class="text-sm">
            <span v-html="item" />
          </p>
        </div>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
const rubricks = [
  '<strong>Логистика</strong> — здесь вы узнаете о том, как организовывать эффективные логистические процессы, как выбирать оптимальные виды транспорта и складские решения, как управлять запасами и распределением товаров, как снижать логистические издержки и риски.',
  '<strong>Транспорт</strong> — здесь вы узнаете о том, какие транспортные средства и услуги доступны на рынке, какие преимущества и недостатки у каждого из них, какие требования и нормы действуют в отношении транспортировки грузов, как обеспечить безопасность и качество перевозок.',
  '<strong>Экспорт / Импорт</strong> — здесь вы узнаете о том, как вести внешнеэкономическую деятельность, какие документы и процедуры необходимы для экспорта и импорта товаров, какие тарифы и пошлины действуют в разных странах, как избежать проблем и конфликтов с таможней и контрагентами.',
  '<strong>Таможенное регулирование</strong> — здесь вы узнаете о том, какие изменения происходят в таможенном законодательстве Беларуси и других стран, как они влияют на ваш бизнес, как адаптироваться к новым правилам и требованиям, как защитить свои интересы и права перед таможенными органами.',
  '<strong>Международное сотрудничество</strong> — расскажем о возможностях и перспективах для вашего бизнеса, каких партнеров и ресурсы вы можете использовать для расширения своего присутствия на мировом рынке, какие проблемы и вызовы вы можете столкнуться при международном сотрудничестве.',
  '<strong>Бизнес и события</strong> — здесь вы узнаете о том, как развивать свой бизнес в области логистики, какие стратегии и тактики использовать для повышения своей прибыльности и конкурентоспособности, какие мероприятия и акции проводятся для логистов, как принять в них участие или стать спонсором.',
  '<strong>Мнение эксперта</strong> — на нашем портале вы также можете прочитать рубрику "Мнение эксперта", где мы обсуждаем самые важные и интересные вопросы логистики с ведущими менеджерами крупных логистичеких компаний Республики Беларусь.',
  '<strong>Видео</strong> — вы также можете посмотреть видео репортажи на актуальные темы логистики. Мы показываем вам реальные примеры логистических процессов и операций, интервьюируем экспертов и практиков, демонстрируем новые технологии и оборудование. Наши видео помогут вам лучше понять и увидеть логистику в действии.',
  '<strong>Новости</strong> — здесь вы узнаете о том, что происходит в мире логистики, какие события и новости влияют на ваш бизнес, какие тенденции и инновации появляются в сфере логистики, какие достижения и награды получают логистические компании и специалисты.',
]
</script>

<style scoped></style>